# LinkedFileOpenInOtherDoc Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..LinkedFileOpenInOtherDoc Property
BuiltInFailures..::..LinkFailures Class See Also
---
Linked file cannot be reloaded because it is loaded into another open document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LinkedFileOpenInOtherDoc { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinkedFileOpenInOtherDoc As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LinkedFileOpenInOtherDoc {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace